<template>
  <div class="emotion">
    <el-popover :placement="position" :width="width" trigger="hover">
      <div class="emotion-menu">
        <span
          class="emotion-item"
          v-for="(item, index) in emotionMenu"
          :key="index"
          @click="selectedEmotion(item)"
          v-html="parsingEmoji(item)"
        ></span>
      </div>
      <div slot="reference" class="img">
        <img class="emotion-img" src="../../images/emotion-icon.png" title="插入表情" alt="插入表情" />
      </div>
    </el-popover>
  </div>
</template>

<script>
export default {
  props: {
    position: {
      type: String,
      default: () => {
        return 'right'
      }
    },
    width: {
      type: Number,
      default: () => {
        return 300
      }
    }
  },
  data() {
    return {
      // emotionMenu: [
      //   '[微笑]', '[撇嘴]', '[色]', '[发呆]', '[得意]', '[流泪]', '[害羞]', '[闭嘴]', '[睡]', '[大哭]',
      //   '[尴尬]', '[发怒]', '[调皮]', '[呲牙]', '[惊讶]', '[难过]', '[酷]', '[囧]', '[抓狂]', '[吐]',
      //   '[偷笑]', '[愉快]', '[白眼]', '[傲慢]', '[饥饿]', '[困]', '[惊恐]', '[流汗]', '[憨笑]', '[悠闲]',
      //   '[奋斗]', '[咒骂]', '[疑问]', '[嘘]', '[晕]', '[疯了]', '[衰]', '[骷髅]', '[敲打]', '[再见]',
      //   '[擦汗]', '[抠鼻]', '[鼓掌]', '[糗大了]', '[坏笑]', '[左哼哼]', '[右哼哼]', '[哈欠]', '[鄙视]', '[委屈]',
      //   '[快哭了]', '[阴险]', '[亲亲]', '[吓]', '[可怜]', '[菜刀]', '[西瓜]', '[啤酒]', '[篮球]', '[乒乓]',
      //   '[咖啡]', '[饭]', '[猪头]', '[玫瑰]', '[凋谢]', '[嘴唇]', '[爱心]', '[心碎]', '[蛋糕]', '[闪电]',
      //   '[炸弹]', '[刀]', '[足球]', '[瓢虫]', '[便便]', '[月亮]', '[太阳]', '[礼物]', '[拥抱]', '[强]',
      //   '[弱]', '[握手]', '[胜利]', '[抱拳]', '[勾引]', '[拳头]', '[差劲]', '[爱你]', '[NO]', '[OK]',
      //   '[爱情]', '[飞吻]', '[跳跳]', '[发抖]', '[怄火]', '[转圈]', '[磕头]', '[回头]', '[跳绳]', '[右太极]',
      //   '[激动]', '[乱舞]', '[献吻]', '[左太极]', '[投降]'
      // ]
      // 部分表情包缺失
      emotionMenu: [
        '[微笑]',
        '[撇嘴]',
        '[色]',
        '[发呆]',
        '[得意]',
        '[流泪]',
        '[害羞]',
        '[闭嘴]',
        '[睡]',
        '[大哭]',
        '[尴尬]',
        '[发怒]',
        '[调皮]',
        '[呲牙]',
        '[惊讶]',
        '[难过]',
        '[囧]',
        '[抓狂]',
        '[吐]',
        '[偷笑]',
        '[愉快]',
        '[白眼]',
        '[傲慢]',
        '[困]',
        '[惊恐]',
        '[流汗]',
        '[憨笑]',
        '[悠闲]',
        '[奋斗]',
        '[咒骂]',
        '[疑问]',
        '[嘘]',
        '[晕]',
        '[衰]',
        '[骷髅]',
        '[敲打]',
        '[再见]',
        '[擦汗]',
        '[抠鼻]',
        '[鼓掌]',
        '[坏笑]',
        '[左哼哼]',
        '[右哼哼]',
        '[哈欠]',
        '[鄙视]',
        '[委屈]',
        '[快哭了]',
        '[阴险]',
        '[亲亲]',
        '[可怜]',
        '[菜刀]',
        '[西瓜]',
        '[啤酒]',
        '[咖啡]',
        '[猪头]',
        '[玫瑰]',
        '[凋谢]',
        '[嘴唇]',
        '[爱心]',
        '[心碎]',
        '[蛋糕]',
        '[炸弹]',
        '[便便]',
        '[月亮]',
        '[太阳]',
        '[拥抱]',
        '[强]',
        '[弱]',
        '[握手]',
        '[胜利]',
        '[抱拳]',
        '[勾引]',
        '[拳头]',
        '[OK]',
        '[跳跳]',
        '[发抖]',
        '[怄火]',
        '[转圈]'
      ]
    }
  },
  methods: {
    selectedEmotion(item) {
      this.$emit('selectedEmotion', item)
    }
  }
}
</script>

<style lang="scss" scoped>
.emotion {
  // margin: 0 10px;
}
.emotion-item {
  font-size: 20px;
  cursor: pointer;
}
.emotion-img {
  width: 20px;
  height: 20px;
  cursor: pointer;
}
.img {
  display: flex;
  align-items: center;
}
</style>
